{
    "en": {
      "startPage": {
        "title": "GateKeeper",
        "startBtn": "Start",
        "optionsBtn": "Options",
        "levelSelectBtn": "Level Select",
        "sandboxBtn": "Sandbox",
        "optionsPopupTitle": "Options",
        "optionsPopupSupport": "Support",
        "optionsPopupCredits": "Credits",
        "optionsPopupTerms": "Terms & Privacy",
        "supportPopupTitle": "Help is on its way!",
        "supportPopupSubject": "Subject",
        "supportPopupSubjectPlaceholder": "Enter the Subject of your Message...",
        "supportPopupEmail": "Email",
        "supportPopupEmailPlaceholder": "Enter your Email...",
        "supportPopupQuestion": "Type of Question",
        "supportPopupQuestion1": "Account Issues (e.g., Login Problems, Password Reset)",
        "supportPopupQuestion2": "Technical Issues (e.g, Errors, Crashes, Bugs)",
        "supportPopupQuestion3": "Content/Feature Requests",
        "supportPopupQuestion4": "Other (Please Describe)",
        "supportPopupMessage": "Message",
        "supportPopupUpload": "Upload Attachments",
        "supportPopupSubmit": "Submit",
        "creditsPopupTitle": "Credits",
        "creditsPopupFrontEnd": "Front-End Developer",
        "creditsPopupBackEnd": "Back-End Developer",
        "termsTitle": "GateKeeper",
        "termsSubheading": "Terms & Policy",
        "termsPrivacyTab": "Privacy Policy",
        "termsServiceTab": "Terms of Service",
        "termsLine1": "Terms of Service for GateKeeper Game",
        "termsLine2": "Last Updated: 3/14/2025",
        "termsLine3": "Welcome to GateKeeper (\"the Game\"), a logic-based puzzle game that challenges your problem-solving skills through various logic gates and challenges. By accessing or using the Game, you agree to be bound by these Terms of Service (\"Terms\"). Please read them carefully.",
        "termsLine4": "<strong>1. Acceptance of Terms</strong> By downloading, installing, or playing GateKeeper, you agree to these Terms and our Privacy Policy. If you do not agree to these Terms, do not use the Game.",
        "termsLine5": "<strong>2. Eligibility </strong> You must be at least 13 years old to play the Game. If you are under 13, you may not use the Game without the consent of a parent or legal guardian. By using the Game, you confirm that you meet these age requirements.",
        "termsLine6": "<strong>3. License to Use </strong> the Game We grant you a limited, non-exclusive, non-transferable license to access and play GateKeeper for personal, non-commercial use. This license does not grant you any rights to the Game's intellectual property.",
        "termsLine7": "<strong>4. User Accounts </strong> You may be required to create an account to play GateKeeper. You are responsible for maintaining the confidentiality of your account credentials and for all activities that occur under your account. If you suspect any unauthorized access to your account, you must notify us immediately.",
        "termsLine8": "<strong>5. Game Rules and Content </strong> •\tGateKeeper is designed for personal entertainment purposes. You may not copy, modify, distribute, or otherwise exploit the Game or its content without prior written consent from the developers. •\tAll content within the Game, including but not limited to graphics, sounds, and code, is the property of the developers and is protected by copyright law.",
        "termsLine9": "<strong>6. In-Game Purchases </strong> The Game may offer in-game purchases. Any purchases made are non-refundable, except as required by law. Prices and availability of in-game items are subject to change without notice.",
        "termsLine10": "<strong>7. Conduct and Restrictions </strong> When using the Game, you agree not to: •\t Engage in any cheating, hacking, or fraudulent activity. •\tUse the Game for any unlawful or inappropriate behavior. •\tHarass, intimidate, or threaten other users. •\tDistribute malicious software, including viruses or malware. We reserve the right to suspend or terminate your account for violating these rules.",
        "termsLine11": "<strong>8. Termination </strong> We may suspend or terminate your access to GateKeeper at any time, with or without cause, and without prior notice, if we believe you have violated these Terms.",
        "termsLine12": "<strong>9. Privacy and Data Collection </strong> Your use of the Game is governed by our Privacy Policy, which outlines the types of information we collect and how it is used. By playing GateKeeper, you consent to our data collection practices as described in the Privacy Policy.",
        "termsLine13": "<strong>10. Disclaimers and Limitations </strong> of Liability GateKeeper is provided \"as is,\" without any warranties, express or implied. We do not guarantee that the Game will be error-free or uninterrupted. To the fullest extent permitted by law, we are not liable for any direct, indirect, incidental, or consequential damages arising from your use of the Game.",
        "termsLine14": "<strong>11. Governing Law </strong> These Terms are governed by and construed in accordance with the laws of United States of America. Any disputes arising out of or in connection with these Terms shall be subject to the exclusive jurisdiction of the courts in Kent, OH.",
        "termsLine15": "<strong>12. Changes </strong> to the Terms We reserve the right to modify or update these Terms at any time. Any changes will be posted on this page with an updated date. By continuing to use the Game after any changes, you accept the updated Terms.",
        "termsLine16": "<strong>13. Contact Information </strong> If you have any questions about these Terms or the Game, please contact us at:",
        "termsLine17": "<strong>GateKeeper</strong></p>",
        "policyTitle": "",
        "policySubheading": "",
        "policyPrivacyTab": "",
        "policyServiceTab": "",
        "policyLine1": "",
        "policyLine2": "",
        "policyLine3": "",
        "policyLine4": "",
        "policyLine5": "",
        "policyLine6": "",
        "policyLine7": "",
        "policyLine8": "",
        "policyLine9": "",
        "policyLine10": "",
        "policyLine11": "",
        "policyLine12": "",
        "policyLine13": "",
        "policyLine14": "",
        "lunaBot": "",
        "aboutPopupTitle": "About",
        "aboutPopupGameInfo": "Game Overview",
        "aboutPopupLogicGates": "Logic Gates",
        "aboutPopupAboutTheGame": "About the Game",
        "aboutPopupLogicGatesOverview": "Logic Gates Overview",
        "aboutPopupGameInfoDesc": "Gatekeeper is a puzzle game where players use logic gates to manipulate circuits and achieve specific outputs. Each level presents a unique challenge, helping players learn how to design and optimize digital circuits. The game is both educational and engaging, sharpening problem-solving skills while allowing players to climb the leaderboard.",
        "aboutPopupLogicGatesDesc": "Logic gates are the fundamental building blocks of digital circuits. They perform Boolean operations on binary inputs (0 and 1) to produce a single output. These gates are essential in computing and digital systems, enabling everything from basic calculations to complex processing."
      },


      "playPage": {
       
      },


      "levelPage": {
        
      }
    },






    "es": {
      "startPage": {
        "title": "Portero",
        "startBtn": "Comenzar",
        "optionsBtn": "Opciones",
        "levelSelectBtn": "Seleccionar nivel",
        "sandboxBtn": "Salvadera",
        "optionsPopupTitle": "Opciones",
        "optionsPopupLanguage": "Idioma",
        "optionsPopupSupport": "Apoyo",
        "optionsPopupCredits": "Créditos",
        "optionsPopupTerms": "Términos y privacidad",
        "supportPopupTitle": "¡La ayuda está en camino!",
        "supportPopupSubject": "Asunto",
        "supportPopupSubjectPlaceholder": "Ingrese el asunto de su mensaje...",
        "supportPopupEmail": "Correo electrónico",
        "supportPopupEmailPlaceholder": "Ingresa tu correo electrónico...",
        "supportPopupQuestion": "Tipo de pregunta",
        "supportPopupQuestion1": "Problemas con la cuenta (p. ej., problemas de inicio de sesión, restablecimiento de contraseña)",
        "supportPopupQuestion2": "Problemas técnicos (p. ej., errores, fallos, bugs)",
        "supportPopupQuestion3": "Solicitudes de contenido/funciones",
        "supportPopupQuestion4": "Otro (por favor, descríbelo)",
        "supportPopupMessage": "Mensaje",
        "supportPopupUpload": "Subir archivos adjuntos",
        "supportPopupSubmit": "Enviar",
        "creditsPopupTitle": "Créditos",
        "creditsPopupFrontEnd": "Desarrollador front-end",
        "creditsPopupBackEnd": "Desarrollador back-end",
        "termsTitle": "GateKeeper",
        "termsSubheading": "Términos y Política",
        "termsPrivacyTab": "Política de Privacidad",
        "termsServiceTab": "Términos de Servicio",
        "termsLine1": "Términos de Servicio del Juego GateKeeper",
        "termsLine2": "Última actualización: 14/3/2025",
        "termsLine3": "Bienvenido a GateKeeper (\"el Juego\"), un juego de lógica que pone a prueba tus habilidades para resolver problemas mediante diversas puertas lógicas y desafíos. Al acceder o usar el Juego, aceptas estos Términos de Servicio (\"Términos\"). Léelos atentamente.",
        "termsLine4": "<strong>1. Aceptación de los Términos:</strong> Al descargar, instalar o jugar a GateKeeper, aceptas estos Términos y nuestra Política de Privacidad. Si no aceptas estos Términos, no uses el Juego.",
        "termsLine5": "<strong>2. Requisitos:</strong> Debes tener al menos 13 años para jugar. Si eres menor de 13 años, no podrás usar el Juego sin el consentimiento de tus padres o tutores legales. Al usar el Juego, confirmas que cumples con estos requisitos de edad.",
        "termsLine6": "<strong>3. Licencia de uso del juego.</strong> Te otorgamos una licencia limitada, no exclusiva e intransferible para acceder y jugar a GateKeeper para uso personal y no comercial. Esta licencia no te otorga ningún derecho sobre la propiedad intelectual del juego.",
        "termsLine7": "<strong>4. Cuentas de usuario</strong> Es posible que se le solicite crear una cuenta para jugar a GateKeeper. Usted es responsable de mantener la confidencialidad de las credenciales de su cuenta y de todas las actividades que se realicen en ella. Si sospecha de algún acceso no autorizado a su cuenta, debe notificárnoslo de inmediato.",
        "termsLine8": "<strong>5. Reglas y contenido del juego</strong> GateKeeper está diseñado para fines de entretenimiento personal. No se puede copiar, modificar, distribuir ni explotar de ninguna otra forma el juego ni su contenido sin el consentimiento previo por escrito de los desarrolladores. Todo el contenido del juego, incluyendo, entre otros, gráficos, sonidos y código, es propiedad de los desarrolladores y está protegido por la ley de derechos de autor.",
        "termsLine9": "<strong>6. Compras dentro del juego:</strong> El juego puede ofrecer compras dentro del juego. Las compras realizadas no son reembolsables, salvo que lo exija la ley. Los precios y la disponibilidad de los artículos del juego están sujetos a cambios sin previo aviso.",
        "termsLine10": "<strong>7. Conducta y Restricciones</strong> Al usar el Juego, te comprometes a no: Realizar trampas, piratear ni realizar actividades fraudulentas. Usar el Juego para cualquier comportamiento ilegal o inapropiado. Acosar, intimidar ni amenazar a otros usuarios. Distribuir software malicioso, incluyendo virus o malware. Nos reservamos el derecho de suspender o cancelar tu cuenta por infringir estas reglas.",
        "termsLine11": "<strong>8. Terminación</strong> Podemos suspender o terminar su acceso a GateKeeper en cualquier momento, con o sin causa, y sin previo aviso, si creemos que ha violado estos Términos.",
        "termsLine12": "<strong>9. Privacidad y Recopilación de Datos:</strong> Tu uso del Juego se rige por nuestra Política de Privacidad, que describe los tipos de información que recopilamos y cómo la utilizamos. Al jugar a GateKeeper, aceptas nuestras prácticas de recopilación de datos, tal como se describe en la Política de Privacidad.",
        "termsLine13": "<strong>10. Descargos de responsabilidad y limitaciones</strong> de responsabilidad. GateKeeper se proporciona \"tal cual\", sin garantías expresas ni implícitas. No garantizamos que el Juego esté libre de errores ni que no sufra interrupciones. En la medida máxima permitida por la ley, no nos hacemos responsables de ningún daño directo, indirecto, incidental o consecuente derivado del uso del Juego.",
        "termsLine14": "<strong>11. Ley aplicable:</strong> Estos Términos se rigen e interpretan de conformidad con las leyes de los Estados Unidos de América. Cualquier disputa que surja de o en relación con estos Términos estará sujeta a la jurisdicción exclusiva de los tribunales de Kent, Ohio.",
        "termsLine15": "<strong>12. Cambios</strong> en los Términos. Nos reservamos el derecho de modificar o actualizar estos Términos en cualquier momento. Cualquier cambio se publicará en esta página con la fecha de actualización. Si continúa usando el Juego después de cualquier cambio, acepta los Términos actualizados.",
        "termsLine16": "<strong>13. Información de contacto</strong> Si tiene alguna pregunta sobre estos Términos o el Juego, contáctenos en:",
        "termsLine17": "<strong> Portero </strong>",
        "policyTitle": "",
        "policySubheading": "",
        "policyPrivacyTab": "",
        "policyServiceTab": "",
        "policyLine1": "",
        "policyLine2": "",
        "policyLine3": "",
        "policyLine4": "",
        "policyLine5": "",
        "policyLine6": "",
        "policyLine7": "",
        "policyLine8": "",
        "policyLine9": "",
        "policyLine10": "",
        "policyLine11": "",
        "policyLine12": "",
        "policyLine13": "",
        "policyLine14": "",
        "lunaBot": "",
        "aboutPopupTitle": "Acerca de",
        "aboutPopupGameInfo": "Información del juego",
        "aboutPopupLogicGates": "Puertas lógicas",
        "aboutPopupAboutTheGame": "Acerca del juego",
        "aboutPopupLogicGatesOverview": "Resumen de las puertas lógicas",
        "aboutPopupGameInfoDesc": "Gatekeeper es un juego de puzles donde los jugadores usan puertas lógicas para manipular circuitos y obtener resultados específicos. Cada nivel presenta un desafío único, que ayuda a los jugadores a aprender a diseñar y optimizar circuitos digitales. El juego es educativo y atractivo, y agudiza las habilidades de resolución de problemas a la vez que permite a los jugadores ascender en la clasificación.",
        "aboutPopupLogicGatesDesc": "Las puertas lógicas son los componentes fundamentales de los circuitos digitales. Realizan operaciones booleanas en entradas binarias (0 y 1) para generar una única salida. Estas puertas son esenciales en la informática y los sistemas digitales, permitiendo desde cálculos básicos hasta procesamiento complejo."
      },


      "playPage": {
        
      },


      "levelPage": {
        
      }
    },






    "de": {
      "startPage": {
        "title": "GateKeeper",
        "startBtn": "Start",
        "optionsBtn": "Optionen",
        "levelSelectBtn": "Levelauswahl",
        "sandboxBtn": "Sandkasten",
        "optionsPopupTitle": "Optionen",
        "optionsPopupLanguage": "Sprache",
        "optionsPopupSupport": "Unterstützung",
        "optionsPopupCredits": "Credits",
        "optionsPopupTerms": "Bedingungen und Datenschutz",
        "supportPopupTitle": "Hilfe ist unterwegs!",
        "supportPopupSubject": "Betreff",
        "supportPopupSubjectPlaceholder": "Geben Sie den Betreff Ihrer Nachricht ein...",
        "supportPopupEmail": "E-Mail",
        "supportPopupEmailPlaceholder": "Geben Sie Ihre E-Mail-Adresse ein...",
        "supportPopupQuestion": "Art der Frage",
        "supportPopupQuestion1": "Kontoprobleme (z. B. Anmeldeprobleme, Passwort zurücksetzen)",
        "supportPopupQuestion2": "Technische Probleme (z. B. Fehler, Abstürze, Bugs)",
        "supportPopupQuestion3": "Inhalts-/Funktionswünsche",
        "supportPopupQuestion4": "Sonstiges (bitte beschreiben)",
        "supportPopupMessage": "Nachricht",
        "supportPopupUpload": "Anhänge hochladen",
        "supportPopupSubmit": "Senden",
        "creditsPopupTitle": "Credits",
        "creditsPopupFrontEnd": "Front-End-Entwickler",
        "creditsPopupBackEnd": "Back-End-Entwickler",
        "termsTitle": "GateKeeper",
        "termsSubheading": "Nutzungsbedingungen und Richtlinien",
        "termsPrivacyTab": "Datenschutzrichtlinie",
        "termsServiceTab": "Nutzungsbedingungen",
        "termsLine1": "Nutzungsbedingungen für das GateKeeper-Spiel",
        "termsLine2": "Letzte Aktualisierung: 14.03.2025",
        "termsLine3": "Willkommen bei GateKeeper („dem Spiel“), einem logikbasierten Puzzlespiel, das Ihre Problemlösungsfähigkeiten durch verschiedene Logikgatter und Herausforderungen auf die Probe stellt. Durch den Zugriff auf oder die Nutzung des Spiels erklären Sie sich mit diesen Nutzungsbedingungen („Bedingungen“) einverstanden. Bitte lesen Sie sie sorgfältig durch.",
        "termsLine4": "<strong>1. Zustimmung zu den Bedingungen</strong> Durch das Herunterladen, Installieren oder Spielen von GateKeeper stimmen Sie diesen Bedingungen und unserer Datenschutzrichtlinie zu. Wenn Sie diesen Bedingungen nicht zustimmen, dürfen Sie das Spiel nicht nutzen.",
        "termsLine5": "<strong>2. Teilnahmeberechtigung</strong> Sie müssen mindestens 13 Jahre alt sein, um das Spiel spielen zu können. Wenn Sie unter 13 Jahre alt sind, dürfen Sie das Spiel nicht ohne Zustimmung eines Elternteils oder Erziehungsberechtigten nutzen. Durch die Nutzung des Spiels bestätigen Sie, dass Sie diese Altersanforderungen erfüllen.",
        "termsLine6": "<strong>3. Lizenz zur Nutzung des Spiels</strong> Wir gewähren Ihnen eine beschränkte, nicht exklusive und nicht übertragbare Lizenz für den Zugriff auf GateKeeper und dessen Nutzung für den persönlichen, nicht-kommerziellen Gebrauch. Diese Lizenz gewährt Ihnen keine Rechte am geistigen Eigentum des Spiels.",
        "termsLine7": "<strong>4. Benutzerkonten</strong> Um GateKeeper spielen zu können, müssen Sie möglicherweise ein Konto erstellen. Sie sind für die Geheimhaltung Ihrer Kontodaten und für alle Aktivitäten, die über Ihr Konto stattfinden, verantwortlich. Sollten Sie einen unbefugten Zugriff auf Ihr Konto vermuten, müssen Sie uns unverzüglich benachrichtigen.",
        "termsLine8": "<strong>5. Spielregeln und Inhalte</strong> GateKeeper dient der persönlichen Unterhaltung. Sie dürfen das Spiel oder seine Inhalte ohne vorherige schriftliche Zustimmung der Entwickler nicht kopieren, verändern, verbreiten oder anderweitig nutzen. Alle Inhalte des Spiels, einschließlich, aber nicht beschränkt auf Grafiken, Sounds und Code, sind Eigentum der Entwickler und urheberrechtlich geschützt.",
        "termsLine9": "<strong>6. In-Game-Käufe</strong> Das Spiel bietet möglicherweise In-Game-Käufe an. Getätigte Käufe sind nicht erstattungsfähig, sofern gesetzlich nicht anders vorgeschrieben. Preise und Verfügbarkeit von In-Game-Artikeln können sich ohne vorherige Ankündigung ändern.",
        "termsLine10": "<strong>7. Verhalten und Einschränkungen</strong> Wenn Sie das Spiel nutzen, erklären Sie sich damit einverstanden, Folgendes nicht zu tun: Betrug, Hacking oder betrügerische Aktivitäten. Das Spiel nicht für rechtswidrige oder unangemessene Zwecke zu nutzen. Andere Benutzer nicht zu belästigen, einzuschüchtern oder zu bedrohen. Schadsoftware, einschließlich Viren oder Malware, nicht zu verbreiten. Wir behalten uns das Recht vor, Ihr Konto bei Verstößen gegen diese Regeln zu sperren oder zu kündigen.",
        "termsLine11": "<strong>8. Kündigung </strong> Wir können Ihren Zugriff auf GateKeeper jederzeit mit oder ohne Grund und ohne vorherige Ankündigung aussetzen oder kündigen, wenn wir der Ansicht sind, dass Sie gegen diese Bedingungen verstoßen haben.",
        "termsLine12": "<strong>9. Datenschutz und Datenerfassung</strong> Ihre Nutzung des Spiels unterliegt unserer Datenschutzrichtlinie. Diese beschreibt, welche Arten von Informationen wir erfassen und wie wir diese verwenden. Indem Sie GateKeeper spielen, stimmen Sie unseren in der Datenschutzrichtlinie beschriebenen Datenerfassungspraktiken zu.",
        "termsLine13": "<strong>10. Haftungsausschlüsse und -beschränkungen</strong> GateKeeper wird „wie besehen“ und ohne jegliche ausdrückliche oder stillschweigende Gewährleistung bereitgestellt. Wir garantieren nicht, dass das Spiel fehlerfrei oder unterbrechungsfrei läuft. Soweit gesetzlich zulässig, haften wir nicht für direkte, indirekte, zufällige oder Folgeschäden, die sich aus Ihrer Nutzung des Spiels ergeben.",
        "termsLine14": "<strong>11. Geltendes Recht</strong> Diese Bedingungen unterliegen dem Recht der Vereinigten Staaten von Amerika und werden entsprechend ausgelegt. Für alle Streitigkeiten, die sich aus oder im Zusammenhang mit diesen Bedingungen ergeben, ist ausschließlich das Gericht in Kent, Ohio, zuständig.",
        "termsLine15": "<strong>12. Änderungen</strong> der Bedingungen Wir behalten uns das Recht vor, diese Bedingungen jederzeit zu ändern oder zu aktualisieren. Alle Änderungen werden auf dieser Seite mit einem aktualisierten Datum veröffentlicht. Indem Sie das Spiel nach Änderungen weiterhin nutzen, akzeptieren Sie die aktualisierten Bedingungen.",
        "termsLine16": "<strong>13. Kontaktinformationen </strong> Wenn Sie Fragen zu diesen Bedingungen oder dem Spiel haben, kontaktieren Sie uns bitte unter:",
        "termsLine17": "<strong>GateKeeper</strong>",
        "policyTitle": "",
        "policySubheading": "",
        "policyPrivacyTab": "",
        "policyServiceTab": "",
        "policyLine1": "",
        "policyLine2": "",
        "policyLine3": "",
        "policyLine4": "",
        "policyLine5": "",
        "policyLine6": "",
        "policyLine7": "",
        "policyLine8": "",
        "policyLine9": "",
        "policyLine10": "",
        "policyLine11": "",
        "policyLine12": "",
        "policyLine13": "",
        "policyLine14": "",
        "lunaBot": "",
        "aboutPopupTitle": "Über",
        "aboutPopupGameInfo": "Spielinfos",
        "aboutPopupLogicGates": "Logikgatter",
        "aboutPopupAboutTheGame": "Über das Spiel",
        "aboutPopupLogicGatesOverview": "Logikgatter-Übersicht",
        "aboutPopupGameInfoDesc": "Gatekeeper ist ein Puzzlespiel, bei dem Spieler Logikgatter verwenden, um Schaltkreise zu manipulieren und bestimmte Ergebnisse zu erzielen. Jeder Level stellt eine einzigartige Herausforderung dar und hilft den Spielern, digitale Schaltkreise zu entwerfen und zu optimieren. Das Spiel ist lehrreich und spannend zugleich. Es schärft die Problemlösungsfähigkeiten und ermöglicht es den Spielern, in der Bestenliste aufzusteigen.",
        "aboutPopupLogicGatesDesc": "Logikgatter sind die grundlegenden Bausteine ​​digitaler Schaltungen. Sie führen boolesche Operationen an binären Eingängen (0 und 1) aus, um einen einzelnen Ausgang zu erzeugen. Diese Gatter sind in der Computertechnik und in digitalen Systemen unverzichtbar und ermöglichen alles von einfachen Berechnungen bis hin zu komplexen Verarbeitungen."
      },


      "playPage": {
        
      },


      "levelPage": {
       
      }
    },








    "fr": {
      "startPage": {
       "title": "Portier",
       "startBtn": "Commencer",
        "optionsBtn": "Possibilités",
        "levelSelectBtn": "Sélection du niveau",
        "sandboxBtn": "Bac à sable",
        "optionsPopupTitle": "Possibilités",
        "optionsPopupLanguage": "Langue",
        "optionsPopupSupport": "Soutien",
        "optionsPopupCredits": "Crédits",
        "optionsPopupTerms": "Conditions et confidentialité",
        "supportPopupTitle": "L'aide est en route !",
        "supportPopupSubject": "Objet",
        "supportPopupSubjectPlaceholder": "Saisissez l'objet de votre message...",
        "supportPopupEmail": "E-mail",
        "supportPopupEmailPlaceholder": "Saisissez votre adresse e-mail...",
        "supportPopupQuestion": "Type de question",
        "supportPopupQuestion1": "Problèmes de compte (par exemple, problèmes de connexion, réinitialisation de mot de passe)",
        "supportPopupQuestion2": "Problèmes techniques (par exemple, erreurs, plantages, bugs)",
        "supportPopupQuestion3": "Demandes de contenu/fonctionnalités",
        "supportPopupQuestion4": "Autre (veuillez préciser)",
        "supportPopupMessage": "Message",
        "supportPopupMessagePlaceholder": "Veuillez indiquer votre message...",
        "supportPopupUpload": "Télécharger des pièces jointes",
        "supportPopupSubmit": "Envoyer",
        "creditsPopupTitle": "Crédits",
        "creditsPopupFrontEnd": "Développeur front-end",
        "creditsPopupBackEnd": "Développeur back-end",
        "termsTitle": "GateKeeper",
        "termsSubheading": "Conditions générales",
        "termsPrivacyTab": "Politique de confidentialité",
        "termsServiceTab": "Conditions d'utilisation",
        "termsLine1": "Conditions d'utilisation du jeu GateKeeper",
        "termsLine2": "Dernière mise à jour : 14/03/2025",
        "termsLine3": "Bienvenue dans GateKeeper (« le Jeu »), un jeu de réflexion basé sur la logique qui met à l'épreuve vos compétences en résolution de problèmes grâce à diverses portes et défis logiques. En accédant au Jeu ou en l'utilisant, vous acceptez les présentes Conditions d'utilisation (« Conditions »). Veuillez les lire attentivement.",
        "termsLine4": "<strong>1. Acceptation des conditions</strong> En téléchargeant, installant ou jouant à GateKeeper, vous acceptez les présentes conditions et notre politique de confidentialité. Si vous n'acceptez pas ces conditions, n'utilisez pas le jeu.",
        "termsLine5": "<strong>2. Admissibilité</strong> Vous devez avoir au moins 13 ans pour jouer au Jeu. Si vous avez moins de 13 ans, vous ne pouvez pas utiliser le Jeu sans le consentement d'un parent ou d'un tuteur légal. En utilisant le Jeu, vous confirmez que vous remplissez les conditions d'âge.",
        "termsLine6": "<strong>3. Licence d'utilisation</strong> du jeu. Nous vous accordons une licence limitée, non exclusive et non transférable pour accéder à GateKeeper et y jouer à des fins personnelles et non commerciales. Cette licence ne vous confère aucun droit sur la propriété intellectuelle du jeu.",
        "termsLine7": "<strong>4. Comptes utilisateurs</strong> Vous devrez peut-être créer un compte pour jouer à GateKeeper. Vous êtes responsable de la confidentialité de vos identifiants et de toutes les activités qui s'y déroulent. Si vous suspectez un accès non autorisé à votre compte, vous devez nous en informer immédiatement.",
        "termsLine8": "<strong>5. Règles et contenu du jeu</strong> GateKeeper est conçu à des fins de divertissement personnel. Vous ne pouvez pas copier, modifier, distribuer ou exploiter de quelque manière que ce soit le jeu ou son contenu sans l'autorisation écrite préalable des développeurs. Tout le contenu du jeu, y compris, mais sans s'y limiter, les graphismes, les sons et le code, est la propriété des développeurs et est protégé par le droit d'auteur.",
        "termsLine9": "<strong>6. Achats en jeu :</strong> le jeu peut proposer des achats en jeu. Aucun achat effectué n'est remboursable, sauf si la loi l'exige. Les prix et la disponibilité des objets en jeu sont susceptibles d'être modifiés sans préavis.",
        "termsLine10": "<strong>7. Conduite et restrictions</strong> Lorsque vous utilisez le Jeu, vous vous engagez à ne pas : tricher, pirater ou commettre d'activités frauduleuses ; utiliser le Jeu pour tout comportement illégal ou inapproprié ; harceler, intimider ou menacer d'autres utilisateurs ; distribuer des logiciels malveillants, y compris des virus ou des logiciels malveillants. Nous nous réservons le droit de suspendre ou de résilier votre compte en cas de violation de ces règles.",
        "termsLine11": "<strong>8. Résiliation</strong> Nous pouvons suspendre ou résilier votre accès à GateKeeper à tout moment, avec ou sans motif, et sans préavis, si nous pensons que vous avez violé les présentes Conditions.",
        "termsLine12": "<strong>9. Confidentialité et collecte de données</strong> Votre utilisation du Jeu est régie par notre Politique de confidentialité, qui décrit les types d'informations que nous collectons et leur utilisation. En jouant à GateKeeper, vous acceptez nos pratiques de collecte de données telles que décrites dans la Politique de confidentialité.",
        "termsLine13": "<strong>10. Clauses de non-responsabilité et limitations</strong> de responsabilité. GateKeeper est fourni « en l'état », sans aucune garantie, expresse ou implicite. Nous ne garantissons pas que le Jeu sera exempt d'erreurs ou ininterrompu. Dans toute la mesure permise par la loi, nous ne sommes pas responsables des dommages directs, indirects, accessoires ou consécutifs découlant de votre utilisation du Jeu.",
        "termsLine14": "<strong>11. Droit applicable.</strong> Les présentes Conditions sont régies et interprétées conformément au droit des États-Unis d'Amérique. Tout litige découlant des présentes Conditions ou en rapport avec celles-ci sera soumis à la compétence exclusive des tribunaux de Kent, dans l'Ohio.",
        "termsLine15": "<strong>12. Modifications</strong> des Conditions. Nous nous réservons le droit de modifier ou de mettre à jour les présentes Conditions à tout moment. Toute modification sera publiée sur cette page avec la date de mise à jour. En continuant à utiliser le Jeu après toute modification, vous acceptez les Conditions mises à jour.",
        "termsLine16": "<strong>13. Coordonnées</strong> Si vous avez des questions sur les présentes Conditions ou sur le Jeu, veuillez nous contacter à :",
        "termsLine17": "<strong>porte</strong>",
        "policyTitle": "",
        "policySubheading": "",
        "policyPrivacyTab": "",
        "policyServiceTab": "",
        "policyLine1": "",
        "policyLine2": "",
        "policyLine3": "",
        "policyLine4": "",
        "policyLine5": "",
        "policyLine6": "",
        "policyLine7": "",
        "policyLine8": "",
        "policyLine9": "",
        "policyLine10": "",
        "policyLine11": "",
        "policyLine12": "",
        "policyLine13": "",
        "policyLine14": "",
        "lunaBot": "",
        "aboutPopupTitle": "À propos",
        "aboutPopupGameInfo": "Informations sur le jeu",
        "aboutPopupLogicGates": "Logic Gates",
        "aboutPopupAboutTheGame": "À propos du jeu",
        "aboutPopupLogicGatesOverview": "Présentation de Logic Gates",
        "aboutPopupGameInfoDesc": "Gatekeeper est un jeu de réflexion où les joueurs utilisent des portes logiques pour manipuler des circuits et obtenir des résultats spécifiques. Chaque niveau présente un défi unique, permettant aux joueurs d'apprendre à concevoir et à optimiser des circuits numériques. Ce jeu à la fois éducatif et captivant développe les compétences de résolution de problèmes tout en permettant aux joueurs de grimper au classement.",
        "aboutPopupLogicGatesDesc": "Les portes logiques sont les éléments fondamentaux des circuits numériques. Elles effectuent des opérations booléennes sur des entrées binaires (0 et 1) pour produire une sortie unique. Ces portes sont essentielles aux systèmes informatiques et numériques, permettant des opérations allant des calculs de base aux traitements complexes."
      },


      "playPage": {
        
      },


      "levelPage": {
       
      }
    }
}
  